tap "apparition47/tap"
tap "ggpeti/rmrec"
tap "homebrew/bundle"
tap "hudochenkov/sshpass"
tap "mulle-kybernetik/software"
tap "peripheryapp/periphery"
tap "tsonglew/dutis", "https://github.com/tsonglew/dutis"
brew "bash"
brew "bat"
brew "cmake"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "pinentry"
brew "gnupg"
brew "imagemagick"
brew "jq"
brew "libgit2"
brew "make"
brew "node"
brew "perltidy"
brew "php"
brew "pinentry-mac"
brew "python@3.12"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "swiftformat"
brew "swiftlint"
brew "thefuck"
brew "uncrustify"
brew "viu"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zshdb"
brew "hudochenkov/sshpass/sshpass"
cask "periphery"
cask "swiftformat-for-xcode"
