tap "ggpeti/rmrec"
tap "mulle-kybernetik/software"
tap "peripheryapp/periphery"
tap "tsonglew/dutis", "https://github.com/tsonglew/dutis"
brew "bash"
brew "libgit2"
brew "bat"
brew "cmake"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "python@3.13"
brew "imagemagick"
brew "jq"
brew "node"
brew "perltidy"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "sshpass"
brew "swiftformat"
brew "swiftlint"
brew "transcrypt"
brew "uncrustify"
brew "viu"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zshdb"
cask "periphery"
cask "swiftformat-for-xcode"
